# числа
# int - целые
# float - дроби
# complex - комлексные

print(abs(-4))
print(abs(4))

# побитовое И
# 0100
# 0110
# 0100 - побитовое И
print(4 & 6)

# побитовое ИЛИ
# 0100
# 0110
# 0110 - побитовое ИЛИ
print(4 | 6)

# побитовое исключающее ИЛИ
print(4 ^ 6)

# побитовый сдвиг вправо или влево
print(4 << 6)
print(4 >> 6)

# перевод в двоичную системы счисления
print(bin(4))

# восьмеричная система счисления
print(oct(401))

# шестнадцатеричная система счисления
print(hex(401))

print(4.5 / 5)

# complex
# a + i*b
n_1 = complex(5, 6)
print(n_1)
n_2 = complex(6, 7)
print(n_1 + n_2)
