# арифметические операции

# деление
print(9 / 4)
print(-9 / 4)

# целочисленное деление
print(9 // 4)
print(-9 // 4)

# остаток от деления
print(9 % 4)

# возведение в степень
print(2 ** (1 / 2))

# логические операции

# больше / меньше
print(40 > 40)
print(3 < 9)

# сравнение
print(4 == 4)

# не равно
print(4 != 5)

# >=, <=
print(40 >= 40)

# логическое И
print(True and True)

# логическое ИЛИ
print(True or False)

# логическое НЕ
print(not True)

# оператор проверки принадлежности - in
print(1 in [1, 2])

# оператор тождественности - is
x = 3
y = 3
print(x is y)
